app/Controllers/Entrada.php

    public function nuevo()
    {
        $info1 = $this->tentrada->where('activo', 1)->findAll();
        $info2 = $this->proveedor->where('activo', 1)->findAll();
        $info3 = $this->usuario->where('activo', 1)->findAll();
        $info4 = $this->item->where('activo', 1)->findAll();
        $info5 = $this->entrada->where('activo', 1)->findAll();
        $info6 = $this->unidadmedida->findAll();
---
SELECT *
FROM `tipo_entrada`
WHERE `activo` = 1
SELECT *
FROM `proveedor`
WHERE `activo` = 1
SELECT *
FROM `usuario`
WHERE `activo` = 1
SELECT *
FROM `item`
WHERE `activo` = 1
SELECT *
FROM `entrada`
WHERE `activo` = 1
SELECT *
FROM `unidad_medida`

    public function editar($id=null)
    {
        // buscamos datos de la entrada
        $entrada = new EntradaModel();
        $data = $entrada->where('id_entrada', $id)->first();

        //creamos el codigo para el c_iva si esta activado o no el checkbox
        $valor_iva=$data['c_iva'];
        $opcion_iva = '';
        if($valor_iva == 1){
            $opcion_iva = '<label for="txt_c_iva">C/IVA</label>';
            $opcion_iva .= '<input type="checkbox" class="" id="txt_c_iva" name="txt_c_iva" style="margin-top: 9px" disabled checked />';
        }else{
            $opcion_iva = '<label for="txt_c_iva">C/IVA</label>';
            $opcion_iva .= '<input type="checkbox" class="" id="txt_c_iva" name="txt_c_iva" style="margin-top: 9px" disabled />';
        }
        $data['opcion_iva'] = $opcion_iva;

        // //codigo para crear opciones de tipo de entrada
        $tipo_entradas = $this->tentrada->where('activo', 1)->findAll();
---
SELECT *
FROM `entrada`
WHERE `id_entrada` = '10'
 LIMIT 1
SELECT *
FROM `tipo_entrada`
WHERE `activo` = 1

        $data['opcionesTipoEntrada'] = $opcionesTipoEntrada;

        // //codigo para crear opciones de proveedor
        $proveedores = $this->proveedor->where('activo', 1)->findAll();
---
SELECT *
FROM `proveedor`
WHERE `activo` = 1

        $data['opcionesProveedor'] = $opcionesProveedor;

        // //codigo para crear opciones de item
        $items = $this->item->where('activo', 1)->findAll();
---
SELECT *
FROM `item`
WHERE `activo` = 1

        $data['opcionesItem'] = $opcionesItem;

        // //codigo para crear opciones de usuario1
        $usuarios = $this->usuario->where('activo', 1)->findAll();
---
SELECT *
FROM `usuario`
WHERE `activo` = 1

        $data['opcionesUsuario1'] = $opcionesUsuario1;

        // //codigo para crear opciones de usuario2
        $usuarios = $this->usuario->where('activo', 1)->findAll();
---
SELECT *
FROM `usuario`
WHERE `activo` = 1