app/Controllers/EntradaSalida.php

    public function index()
    {
        //cargamos todos los iems que tengan el total movimientos > 0 y que esten activos
        $info = $this->item->where('total_movimiento >', 0)->where('activo', 1)->findAll();
---
SELECT *
FROM `item`
WHERE `total_movimiento` > 0
AND `activo` = 1