app/Controllers/Item.php

    public function index($activo=1)
    {
        $info1 = $this->item->where('activo', $activo)->findAll();
        $info2 = $this->unidades->findAll();
        $info3 = $this->producto->findAll();
---
SELECT *
FROM `item`
WHERE `activo` = 1
SELECT *
FROM `producto`

    public function eliminar($id=null)
    {
        $item = new ItemModel();
        // $delete = $producto->where('id_productomedida', $id)->delete($id);
        // $this->producto->update($id,['activo'=>0]);
        $delete = $item->where('id_item', $id)->first();
        $delete = $item->update($id, ['activo' => 0]);
---
UPDATE `item` SET `activo` = 1, `fecha_edit` = '2023-10-11 11:02:22'
WHERE `item`.`id_item` IN ('2')

    public function eliminados($activo = 0)
    {

        $info = $this->item->where('activo', $activo)->findAll();
---
SELECT *
FROM `item`
WHERE `activo` = 0