app/Controllers/Producto.php

    public function index($activo=1)
    {
        $info = $this->producto->where('activo', $activo)->findAll();
---
SELECT *
FROM `producto`
WHERE `activo` = 1

    public function eliminados($activo = 0)
    {
        $info = $this->producto->where('activo', $activo)->findAll();
---
SELECT *
FROM `producto`
WHERE `activo` = 0