app/Controllers/Producto.php

UPDATE `producto` SET `activo` = 0, `fecha_edit` = '2023-10-10 06:55:43'
WHERE `producto`.`id_producto` IN ('7')
---
    public function eliminar($id)
    {
        $this->producto->update($id,['activo'=>0]);