app/Controllers/Proveedor.php

    public function actualizar()
    {

        if ($this->request->is('post') && $this->validate($this->reglas)) {
            $this->proveedor->update($this->request->getPost('id'), [
                'nombre_proveedor' => $this->request->getPost('nombre'),
                'contacto' => $this->request->getPost('contacto'),
                'direccion' => $this->request->getPost('direccion'),
                'ciudad' => $this->request->getPost('ciudad'),
                'telefono' => $this->request->getPost('telefono')

            ]);
---
UPDATE `proveedor` SET `nombre_proveedor` = 'Suministros de Empaque Rápido S.A.', `contacto` = 'LAURA PÉREZ', `direccion` = 'PLAZA DE LAS CAJAS 456', `ciudad` = 'LA PAZ', `telefono` = '3217890', `fecha_edit` = '2023-10-13 09:07:45'
WHERE `proveedor`.`id_proveedor` IN ('3')

    public function reingresar($id)
    {
        $this->proveedor->update($id,['activo'=>1]);
---
UPDATE `proveedor` SET `activo` = 1, `fecha_edit` = '2023-10-13 09:07:15'
WHERE `proveedor`.`id_proveedor` IN ('1')