app/Controllers/Proveedor.php

    public function insertar()
    {

        helper(['form','url']);
        $proveedor = new ProveedorModel();
        $data = [
            'nombre_proveedor' => $this->request->getVar('nombre'),
            'contacto' => $this->request->getVar('contacto'),
            'direccion' => $this->request->getVar('direccion'),
            'ciudad' => $this->request->getVar('ciudad'),
            'telefono' => $this->request->getVar('telefono'),
        ];

        $save = $proveedor->insert_data($data);

        if($save != false){
            $data = $proveedor->where('id_proveedor', $save)->first();
---
SELECT *
FROM `proveedor`
WHERE `id_proveedor` = 6
 LIMIT 1

    public function eliminados($activo = 0)
    {
        $info = $this->proveedor->where('activo', $activo)->findAll();
---
SELECT *
FROM `proveedor`
WHERE `activo` = 0

    public function reingresar($id=null)
    {
        $proveedor = new ProveedorModel();
        $delete = $proveedor->where('id_proveedor', $id)->first();
        $delete = $proveedor->update($id, ['activo' => 1]);
---
SELECT *
FROM `proveedor`
WHERE `id_proveedor` = '6'
 LIMIT 1
UPDATE `proveedor` SET `activo` = 1, `fecha_edit` = '2023-10-21 22:56:57'
WHERE `proveedor`.`id_proveedor` IN ('6')