app/Controllers/Reportes.php


            }else{
                //buscamos la salida con activo = 1 con $result['nro_movimiento'] y $result['id_item']
                $salida = $this->salida->where('nro_movimiento', $result['nro_movimiento'])->where('id_item', $result['id_item'])->where('activo', 1)->first();
---
SELECT *
FROM `salida`
WHERE `nro_movimiento` = '3'
AND `id_item` = '3'
AND `activo` = 1
 LIMIT 1