app/Controllers/Reportes.php

SELECT *
FROM `item`
WHERE `activo` = 1
AND `total_movimiento` > 0
---
    public function vistaKardexFisicoValorado()
    {
        //obtenemos los datos de todos los items activos ycon total movimiento > 0
        $info = $this->item->where('activo', 1)->where('total_movimiento >', 0)->findAll();

SELECT *
FROM `item`
WHERE `id_item` = '3'
 LIMIT 1
SELECT *
FROM `unidad_medida`
WHERE `id_unidadmedida` = '1'
 LIMIT 1
SELECT *
FROM `entrada`
WHERE `id_item` = '3'
AND `activo` = 1
SELECT *
FROM `entrada`
WHERE `fecha_alta` >= '2023-01-01'
AND `fecha_alta` <= '2023-12-31'
SELECT *
FROM `salida`
WHERE `id_item` = '3'
AND `activo` = 1
SELECT *
FROM `salida`
WHERE `fecha_alta` >= '2023-01-01'
AND `fecha_alta` <= '2023-12-31'
---
    public function generaPdfKardexFisicoValorado($fecha_inicio, $fecha_fin, $id_item)
    {
        //obtenemos los datos del item
        $item = $this->item->where('id_item', $id_item)->first();
        //obtenemos la unidad de medida del item
        $unidad = $this->unidadmedida->where('id_unidadmedida', $item['id_unidadmedida'])->first();
        //obtenemos todos los datos de la tabla entrada con el id_item y activo = 1
        $this->entrada->where('id_item', $id_item)->where('activo', 1)->findAll();
        //filtra las entradas por fecha inicio y fecha fin
        $entradas = $this->entrada->where('fecha_alta >=', $fecha_inicio)->where('fecha_alta <=', $fecha_fin)->findAll();

        //obtenemos todos los datos de la tabla salida con el id_item y activo = 1
        $this->salida->where('id_item', $id_item)->where('activo', 1)->findAll();
        //filtra las salidas por fecha inicio y fecha fin
        $salidas = $this->salida->where('fecha_alta >=', $fecha_inicio)->where('fecha_alta <=', $fecha_fin)->findAll();

SELECT *
FROM `entrada`
WHERE `nro_movimiento` = '1'
AND `id_item` = '3'
AND `activo` = 1
 LIMIT 1
---
            if ($result['e_s'] == 'E') {

                //buscamos la entrada con activo = 1 con $result['nro_movimiento'] y $result['id_item']
                $entrada = $this->entrada->where('nro_movimiento', $result['nro_movimiento'])->where('id_item', $result['id_item'])->where('activo', 1)->first();

SELECT *
FROM `tipo_entrada`
WHERE `activo` = 1
SELECT *
FROM `entrada`
WHERE `activo` = 1
AND `id_tipoentrada` = '1'
AND `fecha_alta` >= '2023-01-01'
AND `fecha_alta` <= '2023-12-31'
---


            //obtenemos todos los tipos de entrada con activo = 1
            $tentradas = $this->tentrada->where('activo', 1)->findAll();

            foreach ($tentradas as $tentrada) {
                //buscamos todas las entradas con activo = 1 y id_tentrada = $tentrada['id_tentrada'] y que este dentro del rangos de fechas
                $entradas = $this->entrada->where('activo', 1)->where('id_tipoentrada', $tentrada['id_tipoentrada'])->where('fecha_alta >=', $fecha_inicio)->where('fecha_alta <=', $fecha_fin)->findAll();

SELECT *
FROM `proveedor`
WHERE `id_proveedor` = '3'
 LIMIT 1
---
                        $pdf->Cell(22, 8, str_replace('-', '/', $entrada['fecha']), 1, 0, 'C');
                        $pdf->Cell(20, 8, $entrada['nota_recepcion'], 1, 0, 'R');
                        //buscamos el proveedor con el id_proveedor de la entrada
                        $proveedor = $this->proveedor->where('id_proveedor', $entrada['id_proveedor'])->first();

SELECT *
FROM `usuario`
WHERE `activo` = 1
---
            $pdf->SetFont('Arial', '', 8);

            //obtenemos los datos de todos los usuarios con activo 1
            $usuarios = $this->usuario->where('activo', 1)->findAll();

SELECT *
FROM `entrada`
WHERE `activo` = 1
AND `id_usuario2` = '1'
AND `fecha_alta` >= '2023-01-01'
AND `fecha_alta` <= '2023-12-31'
---

            foreach ($usuarios as $usuario) {
                //buscamos todas las entradas con activo = 1 y id_usuario = $usuario['id_usuario'] y que este dentro del rangos de fechas
                $entradas = $this->entrada->where('activo', 1)->where('id_usuario2', $usuario['id_usuario'])->where('fecha_alta >=', $fecha_inicio)->where('fecha_alta <=', $fecha_fin)->findAll();

SELECT *
FROM `item`
WHERE `id_item` = '1'
 LIMIT 1
---

                    foreach ($entradas as $entrada) {
                        //buscamos el item con el id_item de la entrada
                        $item = $this->item->where('id_item', $entrada['id_item'])->first();