app/Controllers/Reportes.php

            $pdf->SetFont('Arial', '', 9);

            //obtenemos todos los proveedores con activo = 1
            $proveedores = $this->proveedor->where('activo', 1)->findAll();

            foreach ($proveedores as $proveedor) {
                //buscamos todas las entradas con activo = 1 y id_proveedor = $proveedor['id_proveedor'] y que este dentro del rangos de fechas
                $entradas = $this->entrada->where('activo', 1)->where('id_proveedor', $proveedor['id_proveedor'])->where('fecha_alta >=', $fecha_inicio)->where('fecha_alta <=', $fecha_fin)->findAll();
---
SELECT *
FROM `proveedor`
WHERE `activo` = 1
SELECT *
FROM `entrada`
WHERE `activo` = 1
AND `id_proveedor` = '1'
AND `fecha_alta` >= '2023-01-01'
AND `fecha_alta` <= '2023-12-31'


                    foreach ($entradas as $entrada) {
                        //buscamos el item con el id_item de la entrada
                        $item = $this->item->where('id_item', $entrada['id_item'])->first();
---
SELECT *
FROM `item`
WHERE `id_item` = '1'
 LIMIT 1