app/Controllers/Salida.php

SELECT *
FROM `tipo_salida`
WHERE `activo` = 1
SELECT *
FROM `proveedor`
WHERE `activo` = 1
SELECT *
FROM `usuario`
WHERE `activo` = 1
SELECT *
FROM `item`
WHERE `activo` = 1
SELECT *
FROM `salida`
WHERE `activo` = 1
SELECT *
FROM `unidad_medida`
---
    public function nuevo()
    {
        $info1 = $this->tsalida->where('activo', 1)->findAll();
        $info2 = $this->proveedor->where('activo', 1)->findAll();
        $info3 = $this->usuario->where('activo', 1)->findAll();
        $info4 = $this->item->where('activo', 1)->findAll();
        $info5 = $this->salida->where('activo', 1)->findAll();
        $info6 = $this->unidadmedida->findAll();

SELECT *
FROM `salida`
WHERE `id_salida` = '1'
 LIMIT 1
SELECT *
FROM `tipo_salida`
WHERE `activo` = 1
SELECT *
FROM `item`
WHERE `activo` = 1
---
    public function editar($id=null)
    {
        // buscamos datos de la entrada
        $salida = new SalidaModel();
        $data = $salida->where('id_salida', $id)->first();



        // //codigo para crear opciones de tipo de salida
        $tiposSalida = $this->tsalida->where('activo', 1)->findAll();
        $opcionesTipoSalida = '<label for="txt_id_tiposalida">Tipo de Salida</label>';
        $opcionesTipoSalida .= '<select class="form-select" id="txt_id_tiposalida" name="txt_id_tiposalida" required >';
        $opcionesTipoSalida .= '<option value="">Seleccionar Tipo de Salida</option>';
        foreach ($tiposSalida as $row) {
            if ($row['id_tiposalida'] == $data['id_tiposalida']) {
                $opcionesTipoSalida .= '<option value="' . $row['id_tiposalida'] . '" selected>' . $row['nombre_salida'] . '</option>';
            } else {
                $opcionesTipoSalida .= '<option value="' . $row['id_tiposalida'] . '">' . $row['nombre_salida'] . '</option>';
            }
        }
        $opcionesTipoSalida .= '</select>';
        $data['opcionesTipoSalida'] = $opcionesTipoSalida;

        // //codigo para crear opciones de item
        $items = $this->item->where('activo', 1)->findAll();

SELECT *
FROM `usuario`
WHERE `activo` = 1
---
        $data['opcionesItem'] = $opcionesItem;

        // //codigo para crear opciones de usuario1
        $usuarios = $this->usuario->where('activo', 1)->findAll();

SELECT *
FROM `usuario`
WHERE `activo` = 1
---
        $data['opcionesUsuario1'] = $opcionesUsuario1;

        // //codigo para crear opciones de usuario2
        $usuarios = $this->usuario->where('activo', 1)->findAll();