app/Controllers/Tsalida.php

    public function editar($id=null)
    {
        $tsalida = new TsalidaModel();
        $data = $tsalida->where('id_tiposalida', $id)->first();
---
SELECT *
FROM `tipo_salida`
WHERE `id_tiposalida` = '9'
 LIMIT 1

    public function eliminar($id=null)
    {
        $tsalida = new TsalidaModel();
        // $delete = $tsalida->where('id_salidamedida', $id)->delete($id);
        // $this->producto->update($id,['activo'=>0]);
        $delete = $tsalida->where('id_tiposalida', $id)->first();
        $delete = $tsalida->update($id, ['activo' => 0]);
---
SELECT *
FROM `tipo_salida`
WHERE `id_tiposalida` = '7'
 LIMIT 1
UPDATE `tipo_salida` SET `activo` = 0, `fecha_edit` = '2023-10-20 19:31:04'
WHERE `tipo_salida`.`id_tiposalida` IN ('7')

    public function eliminados($activo = 0)
    {
        $info = $this->tsalida->where('activo', $activo)->findAll();
---
SELECT *
FROM `tipo_salida`
WHERE `activo` = 0