app/Controllers/Unidades.php

SELECT *
FROM `unidad_medida`
WHERE `id_unidadmedida` = '5'
 LIMIT 1
UPDATE `unidad_medida` SET `activo` = 0, `fecha_edit` = '2023-10-19 21:03:38'
WHERE `unidad_medida`.`id_unidadmedida` IN ('5')
---
    public function eliminar($id=null)
    {
        $unidades = new UnidadesModel();
        // $delete = $unidades->where('id_unidadmedida', $id)->delete($id);
        // $this->producto->update($id,['activo'=>0]);
        $delete = $unidades->where('id_unidadmedida', $id)->first();
        $delete = $unidades->update($id, ['activo' => 0]);

SELECT *
FROM `unidad_medida`
WHERE `id_unidadmedida` = '5'
 LIMIT 1
UPDATE `unidad_medida` SET `activo` = 1, `fecha_edit` = '2023-10-19 22:37:58'
WHERE `unidad_medida`.`id_unidadmedida` IN ('5')
---
    public function reingresar($id=null)
    {
        $unidades = new UnidadesModel();
        $delete = $unidades->where('id_unidadmedida', $id)->first();
        $delete = $unidades->update($id, ['activo' => 1]);