app/Controllers/Usuario.php

SELECT *
FROM `usuario`
WHERE `activo` = 1
---
    public function index($activo=1)
    {
        $info = $this->usuario->where('activo', $activo)->findAll();