app/Models/ProveedorModel.php

INSERT INTO `proveedor` (`nombre_proveedor`, `contacto`, `direccion`, `ciudad`, `telefono`) VALUES ('TEST4', 'TEST4', 'TEST4', 'TEST4', '12344')
---
    public function insert_data($data){
        if($this->db->table($this->table)->insert($data)){